Show / Hide Table of Contents
Class TemperatureCurve2D
Reperesents a thermal curve.
Inheritance
System.Object
OpenObject
Polygon2D
TemperatureCurve2D
Inherited Members
 Polygon2D.Points
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Geometry2D
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Geometry2D.TemperatureCurve2D,CI.Geometry2D")]
public class TemperatureCurve2D : Polygon2D
Constructors
Improve this Doc   View Source
TemperatureCurve2D()
Constructor
Declaration
public TemperatureCurve2D()
Properties
Improve this Doc   View Source
Temperature
The temperature [K]
Declaration
public double Temperature { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source